{
  "backend/main.mo": "Main backend actor that manages document storage with CRUD operations (add, get, search, delete, list) enforcing owner-based access control and integrating blob storage for document files.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features for file import functionality, mapping them to source files, components, and test requirements with high confidence ratings.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing their purpose and functionality in the document scanning application.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining a comprehensive design system using OKLCH color space for both light and dark themes.",
  "frontend/index.html": "HTML entry point for the Document Scanner application that loads the React app via main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for the scan page (/) and library page (/library), wrapped in a shared Layout component.",
  "frontend/src/components/CameraCapture.tsx": "Camera capture component using the useCamera hook to provide video preview, photo capture functionality, and error handling for document scanning.",
  "frontend/src/components/DocumentCard.tsx": "Document card component displaying a PDF thumbnail with download and delete actions, including confirmation dialog for deletion.",
  "frontend/src/components/FileImport.tsx": "File import component with drag-and-drop support that validates and handles image file selection (JPEG, PNG, WebP) with size and type validation up to 10MB.",
  "frontend/src/components/ImageEditor.tsx": "React component for adjusting document boundaries by dragging corner points on an image, with automatic corner detection and perspective transformation. Transitions to ImageEnhancement component after user confirms the crop.",
  "frontend/src/components/ImageEnhancement.tsx": "React component providing image enhancement controls (brightness, contrast, black & white filter) with real-time canvas-based preview. Outputs the enhanced image as a data URL when user confirms.",
  "frontend/src/components/Layout.tsx": "Main application layout component with header navigation (Scan/Library), Internet Identity login/logout button, and footer. Uses TanStack Router for navigation and renders child routes via Outlet.",
  "frontend/src/components/PageCollection.tsx": "Component for managing scanned document pages with drag-and-drop reordering, page deletion with confirmation dialog, and actions to add more pages or generate PDF.",
  "frontend/src/components/PDFPreview.tsx": "Component for naming, previewing, and saving multi-page PDF documents. Generates PDF from image files, allows download, and uploads to backend with progress tracking using ExternalBlob.",
  "frontend/src/components/SearchBar.tsx": "Simple search input component with a search icon that accepts a controlled value and onChange handler for filtering documents.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state, invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useDocumentCollection.ts": "Custom hook managing local state for a collection of document page files with methods to add, remove, reorder, and clear pages.",
  "frontend/src/hooks/useDocumentLibrary.ts": "Hook combining document listing and deletion queries with a search filter function, providing a unified interface for document library operations.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and auth client lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for document operations (list, search, get, add, delete) using the backend actor with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark theme colors, typography, and design tokens using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/LibraryPage.tsx": "Displays a searchable grid of document cards with loading states, error handling, and empty state messages for the document library.",
  "frontend/src/pages/ScanPage.tsx": "Multi-step document scanning workflow managing capture (camera/file), editing, page collection, and PDF preview states with navigation between steps.",
  "frontend/src/utils/imageFilters.ts": "Implements image filter functions for brightness, contrast, and black-and-white conversion by manipulating ImageData pixel arrays.",
  "frontend/src/utils/imageProcessing.ts": "Provides document corner detection using Sobel edge detection and perspective transformation to correct document orientation and crop boundaries.",
  "frontend/src/utils/pdfGenerator.ts": "Generates PDF files from image files by converting them to JPEG, scaling to A4 dimensions, and manually constructing PDF structure (catalog, pages, XObjects, streams) without external libraries.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended typography, container queries, animations, and custom design tokens for a component library.",
  "project_state.json": "Project metadata defining a document scanning application with features for camera capture, edge detection, perspective correction, image enhancement, PDF generation, and document library management."
}